app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Algebra"], ["room_number", 202], ["created_at", "2021-03-27 15:45:31.592398"], ["updated_at", "2021-03-27 15:45:31.592398"]]

  def show
    @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @school_class = SchoolClass.find_by_id(params[:id])

    @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 201], ["updated_at", "2021-03-27 15:49:16.900203"], ["id", 1]]