app/controllers/students_controller.rb

  def edit
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @student = Student.find_by_id(params[:id])

    @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Samuel"], ["updated_at", "2021-03-27 15:57:58.449339"], ["id", 3]]